БухЭксп/DataProcessors/ЗагрузкаДанныхИзВнешнихФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхИзВнешнихФайлов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатурыБЭД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наличие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/DataProcessors/ЗагрузкаДанныхИзВнешнихФайлов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформлениеХарактеристик();
	
	ИспользоватьХарактеристикиНоменклатуры = Ложь;
	
	Параметры.Свойство("ЗагружатьКоличество"		,ЗагружатьКоличество);
	Параметры.Свойство("ЗагружатьОценку"			,ЗагружатьОценку);
	Параметры.Свойство("ЗагружатьЦену"				,ЗагружатьЦену);
	Параметры.Свойство("ЗагружатьЦеныПоВидамЦен"	,ЗагружатьЦеныПоВидамЦен);
	Параметры.Свойство("ИмяТЧ"						,ИмяТЧ);
	Параметры.Свойство("ЗагружатьЕдиницыИзмерения"	,ЗагружатьЕдиницыИзмерения);
	
	Если Параметры.Свойство("Заголовок") И ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
		
	КонецЕсли;
		
	ИнициализироватьТабличныйДокумент();
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("По запросу");
	МассивЗначений.Добавить("Мало");
	МассивЗначений.Добавить("Достаточно");
	МассивЗначений.Добавить("Много");
	Элементы.ТоварыОценка.СписокВыбора.ЗагрузитьЗначения(МассивЗначений);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыОценкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Текст = ВРег(ТекущиеДанные.НаличиеСтрокой);
	
	Если Текст = Врег("Мало") ИЛИ Текст = "1" Тогда
		ТекущиеДанные.Наличие = 1;
		ТекущиеДанные.НаличиеСтрокой = НСтр("ru = 'Мало'");
	ИначеЕсли Текст = Врег("Достаточно") ИЛИ Текст = "2" Тогда
		ТекущиеДанные.Наличие = 2;
		ТекущиеДанные.НаличиеСтрокой = НСтр("ru = 'Достаточно'");
	ИначеЕсли Текст = Врег("Много") ИЛИ Текст = "3" Тогда
		ТекущиеДанные.Наличие = 3;
		ТекущиеДанные.НаличиеСтрокой = НСтр("ru = 'Много'");
	Иначе
		ТекущиеДанные.Наличие = 0;
		ТекущиеДанные.НаличиеСтрокой = НСтр("ru = 'По запросу'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитов = РеквизитыНоменклатуры(СтрокаТаблицы.Номенклатура);
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЗначенияРеквизитов);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)
	Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг1;
	Элементы.ФормаДалее.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТовары(Команда)
	
	Если ПроверитьЗаполнениеПолей() Тогда 
		
		СписокТоваров = ПолучитьРаспознанныеТовары(Объект.Товары, ВидыЦен);
		Закрыть(СписокТоваров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C1").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C2").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C3").Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C4").Текст);
	
	Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.'"));
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	СопоставитьДанныеТабличногоДокументаСДаннымиИБ();
	
	Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг2;
	Элементы.ПеренестиТовары.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция РеквизитыНоменклатуры(Знач СсылкаНаОбъект);
	ЗначенияРеквизитов = ТорговыеПредложенияБП.РеквизитыНоменклатурыПриИзменении(СсылкаНаОбъект, "Код, ЕдиницаИзмерения, ВидСтавкиНДС");
	ЗначенияРеквизитов.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.СтавкаНДС(ЗначенияРеквизитов.ВидСтавкиНДС, ТекущаяДатаСеанса()));
	
	Возврат ЗначенияРеквизитов;
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеХарактеристик()

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыХарактеристика.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ХарактеристикиИспользуются");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);


КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьВидыЦен()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЦен.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ВидыЦен.Валюта ЕСТЬ NULL
		|			ТОГДА ВидыЦен.Наименование
		|		ИНАЧЕ ВидыЦен.Наименование + "", "" + ВидыЦен.Валюта.Наименование
		|	КОНЕЦ КАК Наименование
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен.ПометкаУдаления";
	
	ВидыЦен.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	МакетЗаполненияПоВнешнемуИсточнику = Обработки.ЗагрузкаДанныхИзВнешнихФайлов.ПолучитьМакет("МакетЗагрузкиДанных");
	ТабличныйДокумент.Очистить();
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Штрихкод");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Код");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Артикул");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Номенклатура");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Характеристика");
		ТабличныйДокумент.Присоединить(ОбластьТовары);
	КонецЕсли;
	
	Если ЗагружатьЕдиницыИзмерения Тогда
		ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("ЕдиницаИзмерения");
		ТабличныйДокумент.Присоединить(ОбластьТовары);
	КонецЕсли;
	
	Если ЗагружатьКоличество Тогда
		Элементы.ТоварыКоличество.Видимость = Истина;
		ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Количество");
		ТабличныйДокумент.Присоединить(ОбластьТовары);
	КонецЕсли;
	
	Если ЗагружатьОценку Тогда
		Элементы.ТоварыОценка.Видимость = Истина;
		ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("ЗагружатьОценку");
		ТабличныйДокумент.Присоединить(ОбластьТовары);
	КонецЕсли;
	
	Если ЗагружатьЦену Тогда
		Элементы.ТоварыЦена.Видимость = Истина;
		ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Цена");
		ТабличныйДокумент.Присоединить(ОбластьТовары);
	КонецЕсли;
	
	Если ЗагружатьЦеныПоВидамЦен Тогда
		ЗаполнитьВидыЦен();
		
		МассивРеквизитов = Новый Массив;
		ОписаниеТиповЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой));
		СтрокаСИменамиКолонок = "";
		
		Для Каждого ВидЦены Из ВидыЦен Цикл 
			ВидЦены.УникальноеИмя = "ВидЦены_" + СтрЗаменить(ВРег(Строка(ВидЦены.Ссылка.УникальныйИдентификатор())), "-", "x");
			СтрокаСИменамиКолонок = СтрокаСИменамиКолонок + "#&#&#&#." + ВидЦены.УникальноеИмя + ","+ Символы.ПС;
			
			ОбластьВидыЦен = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("ВидЦены");
			ОбластьВидыЦен.Параметры.ЗаголовокВидЦены = ВидЦены.Наименование;
			ТабличныйДокумент.Присоединить(ОбластьВидыЦен);
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ВидЦены.УникальноеИмя,ОписаниеТиповЧисло,"Объект.Товары",ВидЦены.Наименование));
			
		КонецЦикла;
		
		ИзменитьРеквизиты(МассивРеквизитов);    	

		Для Каждого ВидЦены Из ВидыЦен Цикл 
			
			НовыйЭлемент = Элементы.Добавить(ВидЦены.УникальноеИмя, Тип("ПолеФормы"), Элементы.Товары);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Товары." + ВидЦены.УникальноеИмя;
			
		КонецЦикла;

	КонецЕсли;

	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеТабличногоДокументаСДаннымиИБ()
	
	Объект.Товары.Очистить();
	НомераКолонок = Новый Соответствие;
	НомерКолонки = 1;
	
	НомераКолонок.Вставить("КолонкаШтрихкод", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаКод", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаАртикул", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаНоменклатура", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		НомераКолонок.Вставить("КолонкаХарактеристика", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;

	Если ЗагружатьЕдиницыИзмерения Тогда
		НомераКолонок.Вставить("ЕдиницаИзмерения", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	
	Если ЗагружатьКоличество Тогда
		НомераКолонок.Вставить("КолонкаКоличество", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	
	Если ЗагружатьОценку Тогда 
		НомераКолонок.Вставить("КолонкаОценка", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	
	Если ЗагружатьЦену Тогда
		НомераКолонок.Вставить("Цена", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
		НомерКолонки = НомерКолонки +1;
	КонецЕсли;
	
	Если ЗагружатьЦеныПоВидамЦен Тогда
		
		Для Каждого ВидЦены Из ВидыЦен Цикл 
			
			НомераКолонок.Вставить(ВидЦены.УникальноеИмя, "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
			НомерКолонки = НомерКолонки +1;
			
		КонецЦикла;
		
	КонецЕсли;

	
	
	НомерСтроки = 2;
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст)
	Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст);
	
	Пока ЗаполненыНоменклатураКодАртикулШтрихкод Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.КодСтроки = НомерСтроки;
		
		Попытка
			НоваяСтрока.ЗагружаемыйШтрихкод = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст;
			НоваяСтрока.ЗагружаемыйКод = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст;
			НоваяСтрока.ЗагружаемыйАртикул = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст;
			НоваяСтрока.ЗагружаемаяНоменклатура = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст;
			НоваяСтрока.ЗагружаемаяЕдиницаИзмерения = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("ЕдиницаИзмерения")).Текст;
			
			Если ИспользоватьХарактеристикиНоменклатуры Тогда
				НоваяСтрока.ЗагружаемаяХарактеристика = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаХарактеристика")).Текст;
			КонецЕсли;
			
			Если ЗагружатьКоличество Тогда
				КоличествоТекст = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКоличество")).Текст;
				НоваяСтрока.Количество = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(КоличествоТекст);
			КонецЕсли;
			
			Если ЗагружатьОценку Тогда
				
				Текст = ВРег(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаОценка")).Текст);
				
				Если Текст = Врег("Мало") ИЛИ Текст = "1" Тогда
					НоваяСтрока.Наличие = 1;
					НоваяСтрока.НаличиеСтрокой = НСтр("ru = 'Мало'");
				ИначеЕсли Текст = Врег("Достаточно") ИЛИ Текст = "2" Тогда
					НоваяСтрока.Наличие = 2;
					НоваяСтрока.НаличиеСтрокой = НСтр("ru = 'Достаточно'");
				ИначеЕсли Текст = Врег("Много") ИЛИ Текст = "3" Тогда
					НоваяСтрока.Наличие = 3;
					НоваяСтрока.НаличиеСтрокой = НСтр("ru = 'Много'");
				Иначе
					НоваяСтрока.Наличие = 0;
					НоваяСтрока.НаличиеСтрокой = НСтр("ru = 'По запросу'");
				КонецЕсли;
				
			КонецЕсли;
		
			Если ЗагружатьЦену Тогда
				ЦенаТекст = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("Цена")).Текст;
				НоваяСтрока.Цена = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЦенаТекст);
			КонецЕсли;
			
			Если ЗагружатьЦеныПоВидамЦен Тогда
		
				Для Каждого ВидЦены Из ВидыЦен Цикл
					НоваяСтрока[ВидЦены.УникальноеИмя] = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить(ВидЦены.УникальноеИмя)).Текст;
				КонецЦикла;
		
			КонецЕсли;
		
		Исключение
			ОбщегоНазначения.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		НомерСтроки = НомерСтроки + 1;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст)
		Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст)
		Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст)
		Или ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст);	
	КонецЦикла;
	
	СопоставитьНоменклатуруПоШтрихКоду();
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьНоменклатуруПоШтрихКоду()
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	
	"ВЫБРАТЬ
	|	ТаблицаУточнения.ЗагружаемыйШтрихкод КАК ЗагружаемыйШтрихкод,
	|	ТаблицаУточнения.Номенклатура КАК Номенклатура,
	|	ТаблицаУточнения.Характеристика КАК Характеристика,
	|	ТаблицаУточнения.Количество КАК Количество,
	|	ТаблицаУточнения.Цена КАК Цена,
	|	ТаблицаУточнения.Наличие КАК Оценка,
	|	ТаблицаУточнения.НаличиеСтрокой КАК НаличиеСтрокой,
	|	ЕстьNULL(ТаблицаУточнения.ЗагружаемаяЕдиницаИзмерения, """") КАК ЗагружаемаяЕдиницаИзмерения,
	|	ТаблицаУточнения.ЗагружаемаяХарактеристика КАК ЗагружаемаяХарактеристика,
	|	ТаблицаУточнения.ЗагружаемыйАртикул КАК ЗагружаемыйАртикул,
	|	ТаблицаУточнения.ЗагружаемаяНоменклатура КАК ЗагружаемаяНоменклатура,
	|	ТаблицаУточнения.ЗагружаемыйКод КАК ЗагружаемыйКод,
	|	"+?(ЗагружатьЦеныПоВидамЦен, СтрЗаменить(СтрокаСИменамиКолонок, "#&#&#&#", "ТаблицаУточнения"), "")+"
	|	ТаблицаУточнения.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ ТаблицаШтрихкод
	|ИЗ
	|	&КолонкаШтрихкод КАК ТаблицаУточнения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗагружаемыйШтрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаШтрихкод.ЗагружаемыйШтрихкод КАК ЗагружаемыйШтрихкод,
	|	ЕСТЬNULL(Штрихкоды.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ТаблицаШтрихкод.Характеристика КАК Характеристика,
	|	ТаблицаШтрихкод.Количество КАК Количество,
	|	ТаблицаШтрихкод.Цена КАК Цена,
	|	ТаблицаШтрихкод.Оценка КАК Оценка,
	|	ТаблицаШтрихкод.НаличиеСтрокой КАК НаличиеСтрокой,
	|	ТаблицаШтрихкод.ЗагружаемыйАртикул КАК ЗагружаемыйАртикул,
	|	ТаблицаШтрихкод.ЗагружаемыйКод КАК ЗагружаемыйКод,
	|	ТаблицаШтрихкод.ЗагружаемаяНоменклатура КАК ЗагружаемаяНоменклатура,
	|	ТаблицаШтрихкод.ЗагружаемаяХарактеристика КАК ЗагружаемаяХарактеристика,
	|	ТаблицаШтрихкод.ЗагружаемаяЕдиницаИзмерения КАК ЗагружаемаяЕдиницаИзмерения,
	|	"+?(ЗагружатьЦеныПоВидамЦен, СтрЗаменить(СтрокаСИменамиКолонок, "#&#&#&#", "ТаблицаШтрихкод"), "")+"
	|	ТаблицаШтрихкод.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ ПоискПоШтрихКодам
	|ИЗ
	|	ТаблицаШтрихкод КАК ТаблицаШтрихкод
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО ТаблицаШтрихкод.ЗагружаемыйШтрихкод = Штрихкоды.Штрихкод
	|			И (ТаблицаШтрихкод.ЗагружаемыйШтрихкод <> """")
	|			И (Штрихкоды.Номенклатура ССЫЛКА Справочник.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоискПоШтрихКодам.ЗагружаемыйШтрихкод КАК ЗагружаемыйШтрихкод,
	|	ВЫБОР
	|		КОГДА ПоискПоШтрихКодам.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(НоменклатураСсылка.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ИНАЧЕ ПоискПоШтрихКодам.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ПоискПоШтрихКодам.Характеристика КАК Характеристика,
	|	ПоискПоШтрихКодам.Количество КАК Количество,
	|	ПоискПоШтрихКодам.Цена КАК Цена,
	|	ПоискПоШтрихКодам.Оценка КАК Оценка,
	|	ПоискПоШтрихКодам.НаличиеСтрокой КАК НаличиеСтрокой,
	|	ПоискПоШтрихКодам.ЗагружаемыйАртикул КАК ЗагружаемыйАртикул,
	|	ПоискПоШтрихКодам.ЗагружаемаяНоменклатура КАК ЗагружаемаяНоменклатура,
	|	ПоискПоШтрихКодам.ЗагружаемыйКод КАК ЗагружаемыйКод,
	|	ПоискПоШтрихКодам.КодСтроки КАК КодСтроки,
	|	ЕСТЬNULL(НоменклатураСсылка.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Ссылка,
	|	ПоискПоШтрихКодам.ЗагружаемаяХарактеристика КАК ЗагружаемаяХарактеристика,
	|	"+?(ЗагружатьЦеныПоВидамЦен, СтрЗаменить(СтрокаСИменамиКолонок, "#&#&#&#", "ПоискПоШтрихКодам"), "")+"
	|	ПоискПоШтрихКодам.ЗагружаемаяЕдиницаИзмерения КАК ЗагружаемаяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ПоискПоШтрихКодам.ЗагружаемаяЕдиницаИзмерения = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ПоискПоШтрихКодам.Номенклатура ЕСТЬ NULL
	|						ТОГДА ЕСТЬNULL(НоменклатураСсылка.Ссылка.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка))
	|					ИНАЧЕ ПоискПоШтрихКодам.Номенклатура.ЕдиницаИзмерения
	|				КОНЕЦ
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ПоискПоНоменклатуре
	|ИЗ
	|	ПоискПоШтрихКодам КАК ПоискПоШтрихКодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСсылка
	|		ПО (ПоискПоШтрихКодам.ЗагружаемыйАртикул = НоменклатураСсылка.Артикул
	|					И ПоискПоШтрихКодам.ЗагружаемыйАртикул <> """"
	|				ИЛИ ПоискПоШтрихКодам.ЗагружаемаяНоменклатура = НоменклатураСсылка.Наименование
	|					И ПоискПоШтрихКодам.ЗагружаемаяНоменклатура <> """"
	|				ИЛИ ПоискПоШтрихКодам.ЗагружаемыйКод = НоменклатураСсылка.Код
	|					И ПоискПоШтрихКодам.ЗагружаемыйКод <> """")
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоискПоШтрихКодам.Цена,
	|	ПоискПоШтрихКодам.ЗагружаемыйКод,
	|	ПоискПоШтрихКодам.КодСтроки,
	|	ПоискПоШтрихКодам.Характеристика,
	|	ПоискПоШтрихКодам.ЗагружаемыйАртикул,
	|	ПоискПоШтрихКодам.ЗагружаемаяНоменклатура,
	|	ПоискПоШтрихКодам.Количество,
	|	"+?(ЗагружатьЦеныПоВидамЦен, СтрЗаменить(СтрокаСИменамиКолонок, "#&#&#&#", "ПоискПоШтрихКодам"), "")+"
	|	ПоискПоШтрихКодам.ЗагружаемыйШтрихкод,
	|	ВЫБОР
	|		КОГДА ПоискПоШтрихКодам.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(НоменклатураСсылка.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ИНАЧЕ ПоискПоШтрихКодам.Номенклатура
	|	КОНЕЦ,
	|	ПоискПоШтрихКодам.Оценка,
	|	ПоискПоШтрихКодам.НаличиеСтрокой,
	|	ЕСТЬNULL(НоменклатураСсылка.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ПоискПоШтрихКодам.ЗагружаемаяХарактеристика,
	|	ПоискПоШтрихКодам.ЗагружаемаяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ПоискПоШтрихКодам.ЗагружаемаяЕдиницаИзмерения = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ПоискПоШтрихКодам.Номенклатура ЕСТЬ NULL
	|						ТОГДА ЕСТЬNULL(НоменклатураСсылка.Ссылка.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка))
	|					ИНАЧЕ ПоискПоШтрихКодам.Номенклатура.ЕдиницаИзмерения
	|				КОНЕЦ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоискПоНоменклатуре.ЗагружаемыйШтрихкод КАК ЗагружаемыйШтрихкод,
	|	ПоискПоНоменклатуре.Номенклатура КАК Номенклатура,
	|	ПоискПоНоменклатуре.Количество КАК Количество,
	|	ПоискПоНоменклатуре.Цена КАК Цена,
	|	ПоискПоНоменклатуре.Оценка КАК Оценка,
	|	ПоискПоНоменклатуре.НаличиеСтрокой КАК НаличиеСтрокой,
	|	ПоискПоНоменклатуре.ЗагружаемыйАртикул КАК ЗагружаемыйАртикул,
	|	ПоискПоНоменклатуре.ЗагружаемаяНоменклатура КАК ЗагружаемаяНоменклатура,
	|	ПоискПоНоменклатуре.ЗагружаемыйКод КАК ЗагружаемыйКод,
	|	ПоискПоНоменклатуре.КодСтроки КАК КодСтроки,
	|	ПоискПоНоменклатуре.Ссылка КАК Ссылка,
	|	ПоискПоНоменклатуре.ЗагружаемаяХарактеристика КАК ЗагружаемаяХарактеристика,
	|	ПоискПоНоменклатуре.ЗагружаемаяЕдиницаИзмерения КАК ЗагружаемаяЕдиницаИзмерения,
	|	"+?(ЗагружатьЦеныПоВидамЦен, СтрЗаменить(СтрокаСИменамиКолонок, "#&#&#&#", "ПоискПоНоменклатуре"), "")+"
	|	ПоискПоНоменклатуре.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ПоискПоХарактеристикам
	|ИЗ
	|	ПоискПоНоменклатуре КАК ПоискПоНоменклатуре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоискПоХарактеристикам.ЗагружаемыйШтрихкод КАК ЗагружаемыйШтрихкод,
	|	ПоискПоХарактеристикам.Номенклатура КАК Номенклатура,
	|	ПоискПоХарактеристикам.Количество КАК Количество,
	|	ПоискПоХарактеристикам.Цена КАК Цена,
	|	ПоискПоХарактеристикам.Оценка КАК Наличие,
	|	ПоискПоХарактеристикам.НаличиеСтрокой КАК НаличиеСтрокой,
	|	ПоискПоХарактеристикам.ЗагружаемыйАртикул КАК ЗагружаемыйАртикул,
	|	ПоискПоХарактеристикам.ЗагружаемаяНоменклатура КАК ЗагружаемаяНоменклатура,
	|	ПоискПоХарактеристикам.ЗагружаемыйКод КАК ЗагружаемыйКод,
	|	ПоискПоХарактеристикам.КодСтроки КАК КодСтроки,
	|	ПоискПоХарактеристикам.Ссылка КАК Ссылка,
	|	ПоискПоХарактеристикам.Номенклатура.Артикул КАК Артикул,
	|	ПоискПоХарактеристикам.Номенклатура.Код КАК Код,
	|	ПоискПоХарактеристикам.Номенклатура.ВидСтавкиНДС КАК СтавкаНДС,
	|	ЛОЖЬ КАК ХарактеристикиИспользуются,
	|	ПоискПоХарактеристикам.ЗагружаемаяХарактеристика КАК ЗагружаемаяХарактеристика,
	|	"+?(ЗагружатьЦеныПоВидамЦен, СтрЗаменить(СтрокаСИменамиКолонок, "#&#&#&#", "ПоискПоХарактеристикам"), "")+"
	|	ПоискПоХарактеристикам.ЗагружаемаяЕдиницаИзмерения КАК ЗагружаемаяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЕдиницыИзмерения.Ссылка ЕСТЬ NULL
	|			ТОГДА ПоискПоХарактеристикам.ЕдиницаИзмерения
	|		ИНАЧЕ ЕдиницыИзмерения.Ссылка
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ИЗ
	|	ПоискПоХарактеристикам КАК ПоискПоХарактеристикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО ПоискПоХарактеристикам.ЗагружаемаяЕдиницаИзмерения = ЕдиницыИзмерения.Наименование
	|			И (ПоискПоХарактеристикам.ЗагружаемаяЕдиницаИзмерения <> """")";
	
	Запрос.УстановитьПараметр("КолонкаШтрихкод", Объект.Товары.Выгрузить());
	
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеПолей()
	
	ОчиститьСообщения();
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		
	Для Каждого Товар Из Объект.Товары Цикл 
		
		Если НЕ ЗначениеЗаполнено(Товар.Номенклатура) Тогда 
			
			СообщениеПользователю.Текст = НСтр("ru = 'Не заполнена номенклатура'");
			СообщениеПользователю.Поле = СтрШаблон(НСтр("ru = 'Объект.Товары[%1].Номенклатура'"), Объект.Товары.Индекс(Товар));
			СообщениеПользователю.Сообщить();
			Возврат Ложь;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Товар.Характеристика)
					И Товар.ХарактеристикиИспользуются Тогда 
					
			СообщениеПользователю.Текст = НСтр("ru = 'Не заполнена характеристика номенклатуры'");
			СообщениеПользователю.Поле = СтрШаблон(НСтр("ru = 'Объект.Товары[%1].Характеристика'"), Объект.Товары.Индекс(Товар));
			СообщениеПользователю.Сообщить();
			Возврат Ложь;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Товар.ЕдиницаИзмерения) Тогда 
			
			СообщениеПользователю.Текст = НСтр("ru = 'Не заполнена единица измерения номенклатуры'");
			СообщениеПользователю.Поле = СтрШаблон(НСтр("ru = 'Объект.Товары[%1].ЕдиницаИзмерения'"), Объект.Товары.Индекс(Товар));
			СообщениеПользователю.Сообщить();
			Возврат Ложь;
			
		КонецЕсли;
			
	КонецЦикла;

	Возврат Истина;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРаспознанныеТовары(Знач ВсеТовары,Знач ВидыЦен)
	
	МассивОтвет = Новый Массив;
	
	Для Каждого Товар Из ВсеТовары Цикл
		
		Если НЕ ЗначениеЗаполнено(Товар.Номенклатура) Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураТовар = Новый Структура;
		СтруктураТовар.Вставить("Штрихкод"								, Товар.Штрихкод						);
		СтруктураТовар.Вставить("Артикул"								, Товар.Артикул							);
		СтруктураТовар.Вставить("Код"									, Товар.Код								);
		СтруктураТовар.Вставить("Номенклатура"							, Товар.Номенклатура					);
		СтруктураТовар.Вставить("Характеристика"						, Товар.Характеристика					);
		СтруктураТовар.Вставить("ЕдиницаИзмерения"						, Товар.ЕдиницаИзмерения				);
		СтруктураТовар.Вставить("Количество"							, Товар.Количество						);
		СтруктураТовар.Вставить("Цена"									, Товар.Цена							);
		СтруктураТовар.Вставить("СтавкаНДС"								, Товар.СтавкаНДС						);
		СтруктураТовар.Вставить("Оценка"								, Товар.Наличие							);
		СтруктураТовар.Вставить("Наличие"								, Товар.Наличие							);
		СтруктураТовар.Вставить("НаличиеСтрокой"						, Товар.НаличиеСтрокой					);
		СтруктураТовар.Вставить("ХарактеристикиИспользуются"			, Товар.ХарактеристикиИспользуются		);
		СтруктураТовар.Вставить("Модифицирован"							, Истина								);
		СтруктураТовар.Вставить("Организация"							, Справочники.Организации.ПустаяСсылка());

		
		Если ВидыЦен.Количество()>0 Тогда
			
			Для Каждого ВидЦены Из ВидыЦен Цикл 
				СтруктураТовар.Вставить(ВидЦены.УникальноеИмя, Товар[ВидЦены.УникальноеИмя]);
			КонецЦикла;
			
		КонецЕсли;
		
		МассивОтвет.Добавить(СтруктураТовар);
		
	КонецЦикла;
	
	Возврат МассивОтвет;

КонецФункции

#КонецОбласти
